{
  "1": {
    "question": "What OTC medicine is good for a mild headache?",
    "chatbot_answer": "For headache or mild pain such as head pain, muscle aches, toothache, and menstrual pain, OTC options may help.\n\nQuick dosage summary: Paracetamol (acetaminophen) for adults is 500–1000 mg every 4–6 hours as needed, with a maximum of 4000 mg/day (some guidelines recommend ≤3000 mg/day for chronic use). Ibuprofen for adults is 200–400 mg every 4–6 hours as needed, with a maximum OTC dose of 1200 mg/day. Aspirin for adults is 325–650 mg every 4–6 hours for pain or fever, with a maximum of 4000 mg/day.\n\nDetailed information: Paracetamol (Panadol, Uphamol, Tylenol) is used for pain and fever relief. Warnings include avoiding overdose due to liver damage risk. Pregnancy considerations include consulting during pregnancy; suitable for adults and children. Avoid alcohol. Available as tablet or liquid via oral route.\n\nIbuprofen (Advil, Nurofen) is used for pain and inflammation relief. Warnings include stomach upset, GI bleeding risk, and avoiding combination with other NSAIDs. Pregnancy use should be avoided in the third trimester; suitable for adults and children. Avoid use with aspirin or blood thinners. Available as tablet or capsule via oral route.\n\nAspirin (Bayer, generic aspirin) is used for pain and fever relief but is less preferred due to bleeding risk. Warnings include GI irritation and bleeding; not for children under 16 or those with ulcer history. Avoid in pregnancy. Avoid blood thinners. Available as tablet via oral route.\n\nTip: Consider your specific needs—some options may be gentler on the stomach, while others work better for inflammation. Avoid overdose, especially with paracetamol. Paracetamol is generally safer for children and those with stomach issues when used correctly.\n\nHome care advice includes drinking water and resting in a quiet environment. Seek medical advice if headache is severe, persistent over 3 days, associated with fever above 39°C, neurological symptoms, or follows head injury. This is general information, not medical advice."
  },
  "2": {
    "question": "I have a fever of 38°C. What can I take?",
    "chatbot_answer": "For fever with elevated body temperature and chills, OTC options may help.\n\nQuick dosage summary: Paracetamol (acetaminophen) for adults is 500–1000 mg every 4–6 hours as needed, maximum 4000 mg/day (≤3000 mg/day for chronic use). Ibuprofen for adults is 200–400 mg every 4–6 hours as needed, with a maximum OTC dose of 1200 mg/day.\n\nDetailed information: Paracetamol (Panadol, Uphamol, Tylenol) is used for pain and fever relief. Avoid overdose due to liver damage risk. Safe for adults and children when used correctly; consult during pregnancy. Avoid alcohol. Available as tablet or liquid via oral route.\n\nIbuprofen (Advil, Nurofen) is used for pain and inflammation relief. Warnings include stomach upset and GI bleeding risk; avoid combining with other NSAIDs. Avoid in the third trimester of pregnancy. Avoid aspirin and blood thinners. Available as tablet or capsule via oral route.\n\nTip: Use the lowest effective dose, space doses per label, and maintain hydration. Alternating paracetamol and ibuprofen should only be done if advised by a healthcare professional.\n\nHome care advice includes staying hydrated and resting. Seek medical care if fever lasts more than 3 days, exceeds 39°C, or occurs with severe symptoms or in vulnerable individuals. This is general information, not medical advice."
  },
  "3": {
    "question": "Sore throat remedies available over-the-counter?",
    "chatbot_answer": "For common cold symptoms including runny nose, sneezing, nasal congestion, and sore throat, OTC options may help.\n\nQuick dosage summary: Loratadine 10 mg once daily for adults and children aged 6 years and above. Cetirizine 5–10 mg once daily for adults and children aged 6 years and above. Pseudoephedrine for adults is 30–60 mg every 4–6 hours with a maximum of 240 mg/day. Combination cold products require label-specific dosing.\n\nDetailed information: Loratadine (Claritin) is used for allergy-related runny nose and sneezing. Generally well tolerated; mild headache possible. Safe for most; consult during pregnancy. Suitable for adults and children. Tablet via oral route.\n\nCetirizine (Zyrtec, generic cetirizine) is used for allergy relief. May cause drowsiness; avoid alcohol and sedatives. Safe for most; consult during pregnancy. Tablet via oral route.\n\nPseudoephedrine (Clarinase, Sudafed) relieves nasal congestion and sinus pressure. May increase blood pressure and heart rate and cause insomnia; avoid near bedtime. Consult doctor if pregnant. Tablet via oral route.\n\nCombination cold products provide multi-symptom relief. Check labels to avoid duplicate paracetamol and excessive decongestants.\n\nHome care advice includes rest, fluids, and saline nasal spray. Seek medical advice if symptoms worsen or last more than 10 days. This is general information, not medical advice."
  },
  "4": {
    "question": "I have a runny nose and sneezing. Recommend a drug.",
    "chatbot_answer": "For common cold symptoms such as runny nose, sneezing, nasal congestion, and sore throat, OTC options may help.\n\nQuick dosage summary includes loratadine 10 mg once daily, cetirizine 5–10 mg once daily, pseudoephedrine 30–60 mg every 4–6 hours, and combination cold products per label instructions.\n\nDetailed information includes loratadine for non-drowsy allergy relief, cetirizine for allergy relief with possible drowsiness, pseudoephedrine for congestion with cardiovascular warnings, and combination cold products requiring careful label review.\n\nHome care advice includes rest, hydration, and saline sprays. Seek medical advice if symptoms persist beyond 10 days or worsen. This is general information, not medical advice."
  },
  "5": {
    "question": "Stomach upset after dinner – any OTC options?",
    "chatbot_answer": "For indigestion or heartburn with burning chest sensation and bloating, OTC options may help.\n\nQuick dosage summary: Antacids require label-specific dosing. Famotidine for adults is 10–20 mg twice daily or 20 mg at bedtime, with a maximum of 40 mg/day OTC.\n\nDetailed information: Antacids (Gaviscon, Rennie, Tums) neutralize stomach acid for quick relief. May cause constipation or diarrhea and affect absorption of other medications. Safe for most; consult during pregnancy. Available as tablet or liquid via oral route.\n\nFamotidine (Pepcid) reduces stomach acid production. Long-term use requires monitoring and dose adjustment in kidney impairment. Consult during pregnancy. Available as tablet via oral route.\n\nHome care advice includes smaller meals, avoiding trigger foods, and elevating the head during sleep. Seek medical advice if symptoms are frequent or severe. This is general information, not medical advice."
  },
  "6": {
    "question": "My child has mild cough – what should I give?",
    "chatbot_answer": "For dry or productive cough, OTC options may help.\n\nQuick dosage summary: Dextromethorphan for adults is 10–20 mg every 4 hours or 30 mg every 6–8 hours, max 120 mg/day. Guaifenesin and cough lozenges require label-specific dosing.\n\nDetailed information: Dextromethorphan (Robitussin DM, Vicks Formula 44) suppresses dry cough. Avoid in children under 6; risk of serious side effects at high doses. Avoid with MAO inhibitors or SSRIs.\n\nGuaifenesin (Mucinex, Robitussin Chesty Cough) helps loosen phlegm. Drink plenty of water. Generally safe.\n\nCough lozenges soothe the throat. Use as directed.\n\nHome care advice includes hydration and humidifier use. Seek medical advice if cough is severe, persistent, or associated with alarming symptoms. This is general information, not medical advice."
  },
  "7": {
    "question": "Muscle pain from exercise – what OTC works best?",
    "chatbot_answer": "For muscle or joint pain such as sprains, strains, and aches, OTC options may help.\n\nQuick dosage summary: Ibuprofen for adults is 200–400 mg every 4–6 hours as needed, max OTC dose 1200 mg/day. Topical diclofenac requires label-specific dosing.\n\nDetailed information: Ibuprofen (Advil, Nurofen, Brufen) relieves pain and inflammation. Warnings include GI bleeding risk and avoiding combination with other NSAIDs.\n\nTopical diclofenac (Voltaren Gel) provides localized pain relief with fewer systemic risks. For external use only.\n\nHome care advice includes rest, ice, compression, elevation, and gentle stretching. Seek medical advice for severe pain or injury. This is general information, not medical advice."
  },
  "8": {
    "question": "Allergic skin rash – what can I use?",
    "chatbot_answer": "For skin problems including rash, itching, eczema, acne, and fungal infections, OTC options may help.\n\nOptions include hydrocortisone cream for itch and inflammation, clotrimazole for fungal infections, benzoyl peroxide and salicylic acid for acne, and antifungal powders for moisture-related fungal infections.\n\nWarnings include external use only, avoiding eyes and broken skin, and consulting during pregnancy. Most topical products are safe for adults and children when used correctly.\n\nHome care advice includes keeping skin clean and dry and avoiding scratching. Seek medical advice if rash worsens or does not improve. This is general information, not medical advice."
  },
  "9": {
    "question": "Mild insomnia – any safe OTC medicines?",
    "chatbot_answer": "An OTC option that may help with mild insomnia is melatonin.\n\nMelatonin (Natrol) is used for insomnia and sleep onset difficulty. Warnings include possible daytime drowsiness and interactions with sedatives. Timing of use is important. Pregnancy requires medical advice. Available as tablet or orally disintegrating tablet via oral route.\n\nFollow package instructions and consult a healthcare professional if unsure."
  },
  "10": {
    "question": "Motion sickness during travel – suggest options.",
    "chatbot_answer": "For motion sickness with nausea and dizziness, OTC options may help.\n\nMeclizine (Bonine, Bonamine) prevents nausea and dizziness. May cause drowsiness; avoid driving. Consult if pregnant.\n\nDimenhydrinate (Dramamine, Travelmin) relieves motion sickness but may cause drowsiness, dry mouth, or blurred vision. Avoid alcohol and sedatives.\n\nTake medication 30–60 minutes before travel. Home care advice includes sitting in the front seat, looking at the horizon, and ensuring good ventilation. Seek medical advice if symptoms persist. This is general information, not medical advice."
  },
  "11": {
    "question": "How much acetaminophen can an adult take for a headache?",
    "chatbot_answer": "Dosage for Acetaminophen (Tylenol, Panadol): Adults: 500-1000 mg every 4-6 hours as needed; max 4000 mg/day (some guidelines recommend ≤3000 mg/day for chronic use). Children: 10-15 mg/kg every 4-6 hours; max 5 doses in 24 hours. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "12": {
    "question": "Maximum ibuprofen dose in 24 hours for adults?",
    "chatbot_answer": "Dosage for Ibuprofen (Advil, Motrin): Adults: 200-400 mg every 4-6 hours as needed; max OTC dose 1200 mg/day (prescription max 3200 mg/day). Children: 5-10 mg/kg every 6-8 hours; max 40 mg/kg/day. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "13": {
    "question": "Safe diphenhydramine dose for a 5-year-old?",
    "chatbot_answer": "Dosage for Diphenhydramine (Benadryl): Adults: 25-50 mg every 4-6 hours; max 300 mg/day. Children: 1 mg/kg every 6 hours (max 4 doses/day); avoid in children <6 years for sleep. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "14": {
    "question": "Naproxen OTC dose for a 12-year-old?",
    "chatbot_answer": "Dosage for Naproxen (Aleve): Adults: 220 mg every 8-12 hours; max OTC dose 660 mg/day. Take with food to reduce stomach upset. Not recommended for children under 12 unless directed. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "15": {
    "question": "Aspirin dose for heart protection in adults?",
    "chatbot_answer": "Dosage for Aspirin (Bayer, Ecotrin): Adults: 325-650 mg every 4-6 hours for pain or fever; max 4000 mg/day. Low-dose (81 mg once daily) for heart protection. Avoid in children or teens with viral illness due to the risk of Reyes syndrome. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "16": {
    "question": "Loperamide dose for diarrhea in adults and children?",
    "chatbot_answer": "Dosage for Loperamide (Imodium): Adults: 4 mg initially, then 2 mg after each loose stool; max 8 mg/day (OTC) or 16 mg/day (Rx). Children: dosing varies by age — check label carefully. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "17": {
    "question": "Omeprazole 20mg frequency for heartburn?",
    "chatbot_answer": "Dosage for Omeprazole (Prilosec OTC): Adults: 20 mg once daily before breakfast; OTC use limited to 14 days for frequent heartburn. Not recommended for children under 18 years unless prescribed. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "18": {
    "question": "Loratadine dosage for a 4-year-old child?",
    "chatbot_answer": "Dosage for Loratadine (Claritin): Adults and children 6 years and older: 10 mg once daily. Children 2-5 years: 5 mg once daily. Non-drowsy option. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "19": {
    "question": "Famotidine OTC dosage for adult with frequent heartburn?",
    "chatbot_answer": "Dosage for Famotidine (Pepcid): Adults: 10–20 mg twice daily, or 20 mg at bedtime; max 40 mg/day OTC. Children: dosing varies by weight — check label. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "20": {
    "question": "Dextromethorphan dosing for a 7-year-old?",
    "chatbot_answer": "Dosage for Dextromethorphan (Robitussin DM): Adults: 10-20 mg every 4 hours, or 30 mg every 6-8 hours; max 120 mg/day. Children 6-12 years: 5-10 mg every 4 hours; max 60 mg/day. Avoid in children under 4 years. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "21": {
    "question": "Acetaminophen vs ibuprofen – which is better for headache?",
    "chatbot_answer": "OTC options that may help include acetaminophen and ibuprofen.\n\nAcetaminophen (Tylenol, Panadol): Used for headache, fever, and mild pain. Warnings include risk of liver toxicity with high doses or alcohol, tracking total daily dose across combination products, and avoiding multiple acetaminophen-containing products. Pregnancy and age considerations include seeking medical advice during pregnancy, low risk during breastfeeding, and general safety per label if not overdosed. Interactions include alcohol and warfarin (monitoring required). Available as tablet, caplet, syrup, or suppository via oral or rectal routes.\n\nIbuprofen (Advil, Motrin): Used for pain, fever, and arthritis. Warnings include GI bleeding risk, cardiovascular risk with chronic use, taking with food, and avoiding combining multiple NSAIDs. Pregnancy considerations include avoiding in the third trimester and consulting if breastfeeding; use caution in adults aged 65 and above. Interactions include anticoagulants, ACE inhibitors, and diuretics. Available as tablet, caplet, liquid gel, or suspension via oral route.\n\nTip: Consider your specific needs—acetaminophen is gentler on the stomach and good for fever, while ibuprofen helps with inflammation and muscle aches. Both are effective for headaches. Follow package instructions. This is general information, not medical advice."
  },
  "22": {
    "question": "Loratadine vs cetirizine – differences?",
    "chatbot_answer": "OTC options that may help include loratadine and cetirizine.\n\nLoratadine (Claritin): Used for seasonal allergies and allergic rhinitis. Generally non-sedating, though headache may occur. Pregnancy requires medical advice; generally safe per label with verification of pediatric formulations. No listed interactions. Available as tablet, orally disintegrating tablet, or syrup via oral route.\n\nCetirizine (Zyrtec): Used for allergies and hay fever. May cause mild sedation; caution advised with alcohol or CNS depressants. Pregnancy requires medical advice; use caution in young children and adults aged 65 and above. No listed interactions. Available as tablet, capsule, or syrup via oral route.\n\nQuick comparison: Both are non-drowsy antihistamines suitable for daytime allergy relief, with loratadine often preferred for minimal side effects. This is general information, not medical advice."
  },
  "23": {
    "question": "Diphenhydramine vs loratadine – daytime use?",
    "chatbot_answer": "OTC options that may help include diphenhydramine and loratadine.\n\nDiphenhydramine (Benadryl): Used for allergies, itching, and as a sleep aid. Warnings include sedation, anticholinergic effects, avoiding alcohol, and possible paradoxical excitation in children. Pregnancy use should be avoided unless advised. Avoid use for sleep in children under 6 and use caution in adults aged 65 and above. Interactions include MAOIs and CNS depressants. Available as tablet, capsule, or liquid via oral route.\n\nLoratadine (Claritin): Used for seasonal allergies and allergic rhinitis. Generally non-sedating; headache may occur. Pregnancy requires medical advice; generally safe per label with verification of pediatric formulations. No listed interactions. Available as tablet, orally disintegrating tablet, or syrup via oral route.\n\nQuick comparison: Loratadine is preferred for daytime use due to minimal drowsiness. This is general information, not medical advice."
  },
  "24": {
    "question": "Ibuprofen vs naproxen – which lasts longer?",
    "chatbot_answer": "OTC options that may help include ibuprofen and naproxen.\n\nIbuprofen (Advil, Motrin): Used for pain, fever, and arthritis. Warnings include GI bleeding risk, cardiovascular risk with chronic use, taking with food, and avoiding multiple NSAIDs. Pregnancy considerations include avoiding in the third trimester and consulting if breastfeeding; use caution in adults aged 65 and above. Interactions include anticoagulants, ACE inhibitors, and diuretics. Available as tablet, caplet, liquid gel, or suspension via oral route.\n\nNaproxen (Aleve): Used for musculoskeletal pain and arthritis. Warnings include GI bleeding, kidney effects, and cardiovascular risk. Pregnancy considerations include avoiding in the third trimester and using caution in older adults. Interactions include anticoagulants and other NSAIDs. Available as tablet or caplet via oral route.\n\nComparison: Each option has unique benefits and risks. Consider symptoms, medical history, and preferences. This is general information, not medical advice."
  },
  "25": {
    "question": "Omeprazole vs famotidine – which is more effective for acid reflux?",
    "chatbot_answer": "OTC options that may help include omeprazole and famotidine.\n\nOmeprazole (Prilosec OTC): Used for frequent heartburn and GERD (short-term OTC). Long-term warnings include possible vitamin B12 or magnesium deficiency, fracture risk, and C. difficile infection risk. Pregnancy requires medical advice; use short courses and caution in adults aged 65 and above. Interaction includes clopidogrel via CYP2C19. Available as delayed-release tablet or capsule via oral route.\n\nFamotidine (Pepcid): Used for heartburn and acid reflux. Generally safe, with dose adjustment needed in renal impairment. Pregnancy requires medical advice; safe per label. No listed interactions. Available as tablet via oral route.\n\nComparison: Each option has unique benefits and risks. This is general information, not medical advice."
  },
  "26": {
    "question": "Loperamide vs bismuth subsalicylate – best for diarrhea?",
    "chatbot_answer": "OTC options that may help include loperamide and bismuth subsalicylate.\n\nLoperamide (Imodium): Used for acute diarrhea. Warnings include stopping use if no improvement in 48 hours, cardiac toxicity with overdose, and constipation risk. Pregnancy requires caution; avoid in very young children and follow pediatric labeling. No listed interactions. Available as tablet, capsule, or liquid via oral route.\n\nBismuth subsalicylate (Pepto-Bismol): Used for upset stomach, diarrhea, and nausea. Warnings include harmless black tongue or stool, salicylate interactions, and avoidance in children or teens with viral illness due to Reye’s syndrome risk. Pregnancy use should be avoided unless directed. Interactions include anticoagulants and antiplatelets. Available as liquid or chewable tablet via oral route.\n\nComparison: Each option has unique benefits and risks. This is general information, not medical advice."
  },
  "27": {
    "question": "Aspirin vs ibuprofen – which is safer for stomach?",
    "chatbot_answer": "OTC options that may help include ibuprofen and aspirin.\n\nIbuprofen (Advil, Motrin): Used for pain, fever, and arthritis. Warnings include GI bleeding risk and cardiovascular risk with chronic use; take with food and avoid multiple NSAIDs. Pregnancy considerations include avoiding in the third trimester and consulting if breastfeeding. Interactions include anticoagulants, ACE inhibitors, and diuretics. Available as tablet, caplet, liquid gel, or suspension via oral route.\n\nAspirin (Bayer, Ecotrin): Used for pain, fever, and antiplatelet effects at low doses. Warnings include increased bleeding and GI irritation or ulcer risk. Avoid during pregnancy unless directed and avoid in children or teens with viral illness. Interactions include anticoagulants, antiplatelets, and alcohol. Available as tablet, chewable tablet, or enteric-coated tablet via oral route.\n\nComparison: Each option has unique benefits and risks. This is general information, not medical advice."
  },
  "28": {
    "question": "Acetaminophen vs aspirin – which is better for fever?",
    "chatbot_answer": "OTC options that may help include acetaminophen and aspirin.\n\nAcetaminophen (Tylenol, Panadol): Used for headache, fever, and mild pain. Warnings include liver toxicity with high doses or alcohol, tracking total daily dose, and avoiding multiple acetaminophen products. Pregnancy requires medical advice; generally safe per label. Interactions include alcohol and warfarin. Available as tablet, caplet, syrup, or suppository via oral or rectal routes.\n\nAspirin (Bayer, Ecotrin): Used for pain, fever, and antiplatelet effects. Warnings include increased bleeding and GI irritation or ulcer risk. Avoid during pregnancy unless directed and avoid in children or teens with viral illness. Interactions include anticoagulants, antiplatelets, and alcohol. Available as tablet, chewable tablet, or enteric-coated tablet via oral route.\n\nComparison: Each option has unique benefits and risks. This is general information, not medical advice."
  },
  "29": {
    "question": "Vitamin C vs zinc – which helps cold faster?",
    "chatbot_answer": "OTC options that may help include vitamin C and zinc.\n\nVitamin C (Redoxon): Used for immunity support. Warnings include gastrointestinal upset at high doses and possible effects on some lab tests. Generally safe during pregnancy and for all ages per label. No listed interactions. Available as tablet or effervescent tablet via oral route.\n\nZinc (Zincate): Used for immunity support. Warnings include nausea and interactions with antibiotics requiring spaced dosing. Pregnancy requires medical advice; safe per label for age. Interactions include tetracyclines and fluoroquinolones. Available as tablet via oral route.\n\nComparison: Each option has unique benefits and risks. This is general information, not medical advice."
  },
  "30": {
    "question": "Cetirizine vs diphenhydramine – drowsiness comparison?",
    "chatbot_answer": "OTC options that may help include diphenhydramine and cetirizine.\n\nDiphenhydramine (Benadryl): Used for allergies, itching, and as a sleep aid. Causes sedation and anticholinergic effects; avoid alcohol and use caution in children and older adults. Pregnancy use should be avoided unless advised. Interactions include MAOIs and CNS depressants. Available as tablet, capsule, or liquid via oral route.\n\nCetirizine (Zyrtec): Used for allergies and hay fever. May cause mild sedation; caution advised with alcohol or CNS depressants. Pregnancy requires medical advice; use caution in young children and older adults. No listed interactions. Available as tablet, capsule, or syrup via oral route.\n\nQuick comparison: Cetirizine may cause mild drowsiness, while diphenhydramine is significantly sedating. This is general information, not medical advice."
  },
  "31": {
    "question": "Can pregnant women take ibuprofen?",
    "chatbot_answer": "Dosage for Ibuprofen (Advil, Motrin): Adults: 200-400 mg every 4-6 hours as needed; max OTC dose 1200 mg/day (prescription max 3200 mg/day). Children: 5-10 mg/kg every 6-8 hours; max 40 mg/kg/day. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice."
  },
  "32": {
    "question": "Can children under 6 take diphenhydramine?",
    "chatbot_answer": "Dosage for Diphenhydramine (Benadryl): Adults: 25-50 mg every 4-6 hours; max 300 mg/day. Children: 1 mg/kg every 6 hours (max 4 doses/day); avoid in children <6 years for sleep. Important: Always read the product label for specific instructions, as formulations and strengths vary. Consult a healthcare provider for children, elderly, or if you have medical conditions. This is general information, not medical advice."
  },
  "33": {
    "question": "Interactions of acetaminophen with other drugs?",
    "chatbot_answer": "Acetaminophen (Tylenol, Panadol) is used for headache, fever, and mild pain. Warnings include risk of liver toxicity with high doses or alcohol, tracking total daily dose across combination products, and avoiding multiple acetaminophen-containing products. Interactions include alcohol and warfarin (monitoring). Follow package instructions and consult a healthcare professional if unsure."
  },
  "34": {
    "question": "Can aspirin be given to teenagers with flu?",
    "chatbot_answer": "Dosage for Aspirin (Bayer, Ecotrin): Adults: 325-650 mg every 4-6 hours for pain or fever; max 4000 mg/day. Low-dose (81 mg once daily) is used for heart protection. Avoid in children and teenagers with viral illness due to the risk of Reye’s syndrome. Important: Always read the product label for specific instructions. This is general information, not medical advice."
  },
  "35": {
    "question": "Loperamide side effects to watch for?",
    "chatbot_answer": "Loperamide (Imodium) is used for acute diarrhea. Warnings include stopping use if no improvement within 48 hours, risk of cardiac toxicity with overdose, and constipation. Follow package instructions and consult a healthcare professional if unsure."
  },
  "36": {
    "question": "Omeprazole long-term safety?",
    "chatbot_answer": "Omeprazole (Prilosec OTC) is used for frequent heartburn and GERD (short-term OTC use). Long-term use may cause vitamin B12 or magnesium deficiency, fracture risk, and increased risk of Clostridioides difficile infection. Follow package instructions and consult a healthcare professional if unsure."
  },
  "37": {
    "question": "Loratadine in patients with kidney issues?",
    "chatbot_answer": "Loratadine (Claritin) is used for seasonal allergies and allergic rhinitis. It is generally non-sedating and may cause headache. Follow package instructions and consult a healthcare professional if unsure."
  },
  "38": {
    "question": "Naproxen for someone with stomach ulcers?",
    "chatbot_answer": "Naproxen (Aleve) is used for musculoskeletal pain and arthritis. Warnings include gastrointestinal bleeding, kidney effects, and cardiovascular risk. Follow package instructions and consult a healthcare professional if unsure."
  },
  "39": {
    "question": "Supplements safe during pregnancy?",
    "chatbot_answer": "Supplements discussed include vitamin B-complex, vitamin C, probiotics, artificial tears, and ophthalmic lubricants. Warnings include gastrointestinal upset at high doses and the need to avoid megadoses. Supplements are not tightly regulated, and pregnant individuals should consult a healthcare professional before use. This is general information, not medical advice."
  },
  "40": {
    "question": "Dextromethorphan in children under 4 years?",
    "chatbot_answer": "Dextromethorphan (Robitussin DM) is used for dry cough. Warnings include serotonin syndrome risk with SSRIs or MAOIs and misuse potential at high doses. Dosage information states to avoid use in children under 4 years. Follow package instructions and consult a healthcare professional if unsure. This is general information, not medical advice."
  },
  "41": {
    "question": "How does acetaminophen reduce fever?",
    "chatbot_answer": "For fever with elevated body temperature and chills, here are some OTC options that may help.\n\nParacetamol (acetaminophen) (Panadol, Uphamol, Tylenol) is used for pain and fever relief. Warnings include avoiding overdose due to liver damage risk. Pregnancy considerations: safe for most ages; consult for pregnancy. Suitable for adults and children. Avoid alcohol. Available as tablet or liquid via oral route.\n\nIbuprofen (Advil, Nurofen) is used for pain and inflammation relief. Warnings include stomach upset, GI bleeding risk, and avoiding combining with other NSAIDs. Pregnancy considerations: avoid in the third trimester and consult a doctor. Suitable for adults and children. Avoid aspirin and blood thinners. Available as tablet or capsule via oral route.\n\nTip: Consider your specific needs—some options may be gentler on the stomach, while others work better for inflammation. Always read the label and follow dosing instructions.\n\nUse the lowest effective dose and space doses per label. Maintain hydration.\n\nSpecial considerations: Safe for most adults and children when dosed correctly. Alternating paracetamol and ibuprofen should only be done if a healthcare professional advises it.\n\nHome care advice: Stay hydrated and rest.\n\nWhen to see a doctor: Seek care if fever lasts more than 3 days, exceeds 39°C, occurs with confusion, chest pain, severe headache, breathing difficulty, or in infants or immune-compromised individuals.\n\nThis is general information, not medical advice. Consult a healthcare professional if symptoms worsen or persist."
  },
  "42": {
    "question": "Why is ibuprofen anti-inflammatory?",
    "chatbot_answer": "Here is an OTC option that may help.\n\nIbuprofen (Advil, Motrin) is used for pain, fever, and arthritis. Warnings include GI bleeding risk, cardiovascular risk with chronic use, taking with food, and avoiding combining multiple NSAIDs. Pregnancy considerations include avoiding use in the third trimester and consulting if breastfeeding. Age considerations include using caution in those aged 65 and above and verifying pediatric dosing by label. Interactions include anticoagulants, ACE inhibitors, and diuretics. Available as tablet, caplet, liquid gel, or suspension via oral route.\n\nFollow package instructions and consult a healthcare professional if unsure."
  },
  "43": {
    "question": "How do antihistamines work for allergies?",
    "chatbot_answer": "I'd be happy to help with your medical question. However, I'm having trouble generating a response right now. Could you rephrase your question or provide more details?\n\nThis is general information, not medical advice. Consult a healthcare professional if symptoms worsen or persist."
  },
  "44": {
    "question": "Difference between H1 and H2 blockers?",
    "chatbot_answer": "Here are some OTC options that may help.\n\nFamotidine (Pepcid) is used for heartburn and acid reflux. It is generally safe but requires dose adjustment in renal impairment. Pregnancy considerations include seeking medical advice. Safe per label for age. No interactions listed. Available as tablet via oral route.\n\nRanitidine (Zantac, historical) is used for heartburn. Avoid unless advised. Pregnancy considerations include seeking medical advice. Historically safe per label for age. No interactions listed. Available as tablet via oral route.\n\nSalicylic acid (Clean & Clear) is used for acne. Warnings include irritation and avoiding large areas in children. Pregnancy considerations include seeking medical advice. Use caution in children. Available as gel, wash, or pad via topical route.\n\nDocusate sodium (Colace) is used for constipation and hard stools. Warnings include limited efficacy in severe constipation and possible diarrhea. Pregnancy and age are safe per label. No interactions listed. Available as capsule or syrup via oral route.\n\nHydrogen peroxide for ear use (generic) is used for earwax removal. Warnings include ear irritation and avoiding excessive use. Pregnancy and age are safe per label. No interactions listed. Available as drops via otic route.\n\nFollow package instructions and consult a healthcare professional if unsure.\n\nTip: Consider your specific needs—some options may be gentler on the stomach, while others work better for inflammation. Always read the label and follow dosing instructions.\n\nComparison: Each option has unique benefits and risks. Consider your symptoms, medical history, and preferences.\n\nThis is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "45": {
    "question": "How does loperamide stop diarrhea?",
    "chatbot_answer": "For diarrhea with frequent loose stools, here are some OTC options that may help.\n\nOral rehydration salts (Pedialyte, Hydralyte, ORS packets) are used for fluid and electrolyte replacement and preventing dehydration. Warnings include mixing according to instructions and avoiding overly concentrated solutions. Pregnancy considerations: safe for all ages including adults and children. No interactions listed. Available as powder or liquid via oral route.\n\nLoperamide (Imodium, Diacure) reduces bowel movements and provides symptomatic relief. Warnings include avoiding use if diarrhea is bloody, associated with high fever, or suspected bacterial infection. Pregnancy considerations include consulting a doctor if pregnant or breastfeeding. Suitable for adults and children. Few significant interactions; caution with other CNS depressants. Available as tablet or capsule via oral route.\n\nTip: Consider your specific needs—some options may be gentler on the stomach, while others work better for inflammation. Always read the label and follow dosing instructions.\n\nORS is first-line to prevent dehydration. Loperamide is for adults with non-infectious diarrhea only.\n\nSpecial considerations: Children should primarily use ORS; avoid loperamide unless specifically advised.\n\nHome care advice: Stay hydrated, eat bland foods, and avoid dairy and greasy food.\n\nWhen to see a doctor: Seek medical care if diarrhea lasts more than 2 days, is bloody, accompanied by fever, or causes severe dehydration.\n\nThis is general information, not medical advice. Consult a healthcare professional if symptoms worsen or persist."
  },
  "46": {
    "question": "Mechanism of omeprazole for acid reduction?",
    "chatbot_answer": "Here is an OTC option that may help.\n\nOmeprazole (Prilosec OTC) is used for frequent heartburn and short-term OTC treatment of GERD. Warnings include long-term use causing vitamin B12 or magnesium deficiency, fracture risk, and C. difficile risk. Pregnancy considerations include seeking medical advice. Age considerations include using short courses and caution in those aged 65 and above. Interactions include clopidogrel via CYP2C19. Available as delayed-release tablet or capsule via oral route.\n\nFollow package instructions and consult a healthcare professional if unsure."
  },
  "47": {
    "question": "Difference between OTC and prescription doses?",
    "chatbot_answer": "Here are some OTC options that may help.\n\nZinc oxide (Desitin) is used for diaper rash and skin irritation. External use only and generally safe. Pregnancy and age are safe per label. No interactions listed. Available as cream or ointment via topical route.\n\nSulfur ointment (De La Cruz) is used for acne. Warnings include odor, irritation, and dryness. Pregnancy considerations include seeking medical advice. Use caution in children. No interactions listed. Available as ointment via topical route.\n\nCarbamide peroxide (Debrox) is used for earwax removal. Warnings include ear irritation and avoiding use if pain or discharge is present. Pregnancy and age are safe per label. No interactions listed. Available as drops via otic route.\n\nDocusate sodium (Colace) is used for constipation and hard stools. Warnings include limited efficacy in severe constipation and possible diarrhea. Pregnancy and age are safe per label. No interactions listed. Available as capsule or syrup via oral route.\n\nFexofenadine (Allegra) is used for allergies. Warnings include avoiding fruit juices near dosing due to reduced absorption and being non-sedating. Pregnancy considerations include seeking medical advice. Generally safe per label for age. No interactions listed. Available as tablet or suspension via oral route.\n\nFollow package instructions and consult a healthcare professional if unsure.\n\nTip: Consider your specific needs—some options may be gentler on the stomach, while others work better for inflammation. Always read the label and follow dosing instructions.\n\nComparison: Each option has unique benefits and risks. Consider your symptoms, medical history, and preferences.\n\nThis is general information, not medical advice. Consult a healthcare professional if unsure or if symptoms worsen or persist."
  },
  "48": {
    "question": "Why avoid aspirin in children with viral infections?",
    "chatbot_answer": "Here is an OTC option that may help.\n\nAspirin (Bayer, Ecotrin) is used for pain, fever, and low-dose anti-platelet therapy. Warnings include increased bleeding risk and GI irritation or ulcer risk. Pregnancy considerations include avoiding use unless directed. Age considerations include avoiding use in children and teenagers with viral illness and using caution in those aged 65 and above. Interactions include anticoagulants, antiplatelets, and alcohol. Available as tablet, chewable tablet, or enteric-coated tablet via oral route.\n\nFollow package instructions and consult a healthcare professional if unsure."
  },
  "49": {
    "question": "How to take antacids safely?",
    "chatbot_answer": "I'm sorry you're not feeling well. Could you tell me the main symptom you're experiencing? For example: headache, fever, cough, sore throat, rash, stomach upset, or skin irritation.\n\nThis helps me recommend appropriate OTC options.\n\nThis is general information, not medical advice. Consult a healthcare professional if symptoms worsen or persist."
  },
  "50": {
    "question": "How to store OTC drugs safely at home?",
    "chatbot_answer": "I'd be happy to help with your medical question. However, I'm having trouble generating a response right now. Could you rephrase your question or provide more details?\n\nThis is general information, not medical advice. Consult a healthcare professional if symptoms worsen or persist."
  }
}
